espressif/arduino-esp32/libraries/Zigbee/src/ep/ZigbeeFanControl.h
// Copyright 2025 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at

//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

/* Class of Zigbee Fan Control endpoint inherited from common EP class */

#pragma once

#include "soc/soc_caps.h"
#include "sdkconfig.h"
#if CONFIG_ZB_ENABLED

#include "ZigbeeEP.h"

// Custom Arduino-friendly enums for fan mode values
enum ZigbeeFanMode {
  FAN_MODE_OFF = 0x00,
  FAN_MODE_LOW = 0x01,
  FAN_MODE_MEDIUM = 0x02,
  FAN_MODE_HIGH = 0x03,
  FAN_MODE_ON = 0x04,
  FAN_MODE_AUTO = 0x05,
  FAN_MODE_SMART = 0x06,
};

// Custom Arduino-friendly enums for fan mode sequence
enum ZigbeeFanModeSequence {
  FAN_MODE_SEQUENCE_LOW_MED_HIGH = 0x00,
  FAN_MODE_SEQUENCE_LOW_HIGH = 0x01,
  FAN_MODE_SEQUENCE_LOW_MED_HIGH_AUTO = 0x02,
  FAN_MODE_SEQUENCE_LOW_HIGH_AUTO = 0x03,
  FAN_MODE_SEQUENCE_ON_AUTO = 0x04,
};

class ZigbeeFanControl : public ZigbeeEP {
public:
  ZigbeeFanControl(uint8_t endpoint);
  ~ZigbeeFanControl() {}

  // Set the fan mode sequence value
  bool setFanModeSequence(ZigbeeFanModeSequence sequence);

  // Use to get fan mode
  ZigbeeFanMode getFanMode() {
    return _current_fan_mode;
  }

  // Use to get fan mode sequence
  ZigbeeFanModeSequence getFanModeSequence() {
    return _current_fan_mode_sequence;
  }

  // On fan mode change callback
  void onFanModeChange(void (*callback)(ZigbeeFanMode mode)) {
    _on_fan_mode_change = callback;
  }

private:
  void zbAttributeSet(const ezb_zcl_set_attr_value_message_t *message) override;
  //callback function to be called on fan mode change
  void (*_on_fan_mode_change)(ZigbeeFanMode mode);
  void fanModeChanged();

  ZigbeeFanMode _current_fan_mode;
  ZigbeeFanModeSequence _current_fan_mode_sequence;
};

#endif  // CONFIG_ZB_ENABLED
